"""
Дадена е табла 5x9, каде што е поставено човече. Потребно е човечето со качување по ѕидот да стигне до врвот кој е означен со куќичка.

Човечето може да се движи во три насоки: горе, горе-десно и горе-лево за една или две позиции (дијагонално, не е како фигурата коњ во шах). Човечето може и да остане на моменталното поле. Притоа човечето може да се наоѓа само на полињата на кои е поставен зелен осумаголник. Полињата кои не се означени со зелен осумаголник може да се прескокнуваат. Човечето исто така не смее да излезе од таблата. Куќичката е подвижна и се движи лево и десно за една позиција со секое поместување (или избор да не се помести) на човечето. Таа може да застане на било кое поле во редот во кој се наоѓа. Куќичката на почеток се движи во една насока, а кога ќе стигне до крајот на таблата ја менува насоката. Единственото поле во најгорниот ред на кое може да застане човечето е она на кое се наоѓа куќичката.

На слика 1 е покажана една можна почетна состојба на таблата.

За сите тест примери големината на таблата е иста, а позицијата на човечето и куќичката се менуваат и се читаат од стандарден влез. Притоа куќичката секогаш се наоѓа во најгорниот ред. Почетната насока на куќичката исто така се чита од стандарден влез. Позицијата на дозволените полиња е иста за сите тест примери. Ваша задача е да го имплементирате поместувањето на човечето и куќичката во successor функцијата. Акциите се именуваат како „Stoj/Gore 1/Gore 2/Gore-desno 1/Gore-desno 2/Gore-levo 1/Gore-levo 2“. Дополнително, потребно е да проверите дали сте стигнале до целта, односно да ја имплементирате функцијата goal_test и да проверите дали состојбата е валидна. Треба да примените информирано пребарување за да најдете решение со најмал број на чекори.
"""
from constraint import Problem

from searching_framework import informed_search
from searching_framework import utils

class robotHelicopter(Problem):

    def __init__(self,initial,goal=None):
        super().__init__(initial,goal)

    def actions(self,state):
        return self.succesor(state).keys()

    def result(self,state,action):
        return self.succesor(state)[action]

    def successor(self,state):
        successors = dict()

        return successors

    def goal_test(self,state):
        pass

    def h(self,state):
        pass

if __name__ =="__main__":
    pass